RIET/src/Reports/РегистрУчетаРасходаДенежныхСредств/РегистрУчетаРасходаДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегистрУчетаРасходаДенежныхСредств</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

RIET/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

RIET/src/Enums/ВидыПрочихДоходовИРасходов/ВидыПрочихДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрочихДоходовИРасходов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ВозмещениеУбытковКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДолевоеУчастиеВИностранныхОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ДолевоеУчастиеВРоссийскихОрганизациях</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыНеУчитываемыеВЦеляхНалогообложения</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделок</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыПоОперациямСФинансовымиИнструментамиСрочныхСделокОР</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСБезвозмезднымПолучениемИмущества</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСЛиквидациейОсновныхСредств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСоСдачейИмуществаВАренду</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейИмущественныхПравКромеПраваТребования</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейИмущественныхПравПоОбъектамОбслуживающихПроизводств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейНематериальныхАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейОсновныхСредств</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияДоНаступленияСрокаПлатежа</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияКакОказанияФинансовыхУслуг</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПраваТребованияПослеНаступленияСрокаПлатежа</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейПрочегоИмущества</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСРеализациейЦенныхБумаг</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходыСвязанныеСУчастиемВДругихОрганизациях</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>КурсовыеРазницы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДСПоСписаннойКредиторскойЗадолженности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОтчисленияВОценочныеРезервы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПремияПокупателю</name>
    <comment>Премия, выплаченная покупателю</comment>
  </enumValues>
  <enumValues>
    <name>ПрибыльУбытокПрошлыхЛет</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыНачисленныеПоСт269</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоГосударственнымЦеннымБумагам</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоГосударственнымЦеннымБумагамПоСтавке0</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнереализационныеДоходыРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеДоходыРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РазницаМеждуПервоначальнойИНоминальнойСтоимостьюПоДолговымЦеннымБумагам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыНаУслугиБанков</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыОтСниженияСтоимостиАктивов</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеДебиторскойКредиторскойЗадолженности</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ШтрафыПениНеустойкиКПолучениюУплате</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>(Общ)</comment>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>LawsonID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEnglish</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентLawson</name>
    <type>
      <types>CatalogRef.КонтрагентыLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаИспользования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Reports/РегистрУчетаРасходаДенежныхСредств/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

Перем CписокСчетов;
Перем Сч50;
Перем Сч51;
Перем Сч52;
Перем Сч55;

Перем Сч76_01, Сч58_01, Сч58_02, Сч58_04, Сч58_05, Сч68, Сч69, Сч70, Сч91_02;
Перем Сч60_01, Сч60_21, Сч60_31, Сч62_02, Сч62_22, Сч62_32, Сч58_03, Сч60_02, Сч60_22, Сч60_32;

// Возвращает полное наименование элемента справочника, если у этого вида 
// справочников есть реквизит НаименованиеПолное.
// 
// Параметры:      
//    Элемент - элемент справочника, для которого нужно вернуть полное наименование
//
// Возвращаемое значение: 
//  Строка с полным наименованием.
//
Функция ПолноеНаименование(Элемент) Экспорт

	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Элемент) Тогда
		Возврат "";

	ИначеЕсли Элемент.Метаданные().Реквизиты.Найти("НаименованиеПолное") = Неопределено Тогда
		Возврат Элемент.Наименование;;

	ИначеЕсли ОбщегоНазначения.ЗначениеНеЗаполнено(Элемент.НаименованиеПолное) Тогда
		Возврат Элемент.Наименование;

	Иначе
		Возврат Элемент.НаименованиеПолное;
	КонецЕсли;

КонецФункции

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь) Экспорт

	ДокументРезультат.Очистить();

	Макет = ПолучитьМакет("Отчет");

	ОбластьЗаголовок  = Макет.ПолучитьОбласть("Заголовок");

	ОбластьЗаголовок.Параметры.НачалоПериода       = Формат(ДатаНач, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КонецПериода        = Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное;
	ОбластьЗаголовок.Параметры.ИННОрганизации      = "" + Организация.ИНН + "/" + Организация.КПП;
	ДокументРезультат.Вывести(ОбластьЗаголовок);

	// Параметр для показа заголовка
	ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;

	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ОбщегоНазначения.ЗначениеНеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

	ОбластьПодвал        = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьСтрока        = Макет.ПолучитьОбласть("Строка");

	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("СписокСчетов", CписокСчетов);
	Запрос.УстановитьПараметр("ДатаНач",      НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон",      КонецДня(ДатаКон));

	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.ВалютнаяСуммаОборотКт КАК ВалСумма,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК Сумма,
	|	ХозрасчетныйОборотыДтКт.ВалютаКт КАК Валюта,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК Счет,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Субконто1,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК Субконто2,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК Субконто3,
	|	ХозрасчетныйОборотыДтКт.Период КАК ДатаОперации,
	|	ХозрасчетныйОборотыДтКт.Регистратор,
	|	ХозрасчетныйОборотыДтКт.Организация,
	|	ХозрасчетныйОборотыДтКт.НомерСтроки,
	|	Хозрасчетный.Регистратор КАК Регистратор1,
	|	Хозрасчетный.НомерСтроки,
	|	Хозрасчетный.Содержание
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКон, Запись, , , СчетКт В ИЕРАРХИИ (&СписокСчетов), , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
	|		ПО ХозрасчетныйОборотыДтКт.Регистратор = Хозрасчетный.Регистратор И ХозрасчетныйОборотыДтКт.НомерСтроки = Хозрасчетный.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОперации";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();

	ИтогСумма = 0;

	Пока Выборка.Следующий() Цикл

		ОбластьСтрока.Параметры.Дата        = Формат(Выборка.ДатаОперации, "ДФ=dd.MM.yyyy");
		ОбластьСтрока.Параметры.Сумма       = Выборка.Сумма;
		ОбластьСтрока.Параметры.ВалСумма    = Выборка.ВалСумма;
		ОбластьСтрока.Параметры.Валюта      = Выборка.Валюта;
		ОбластьСтрока.Параметры.Расшифровка = Выборка.Регистратор;

		ИтогСумма  = ИтогСумма + Выборка.Сумма;
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Договор    = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

		Для НомерСубконто = 1 по 3 Цикл

			ЗначениеСубконто = Выборка["Субконто" + НомерСубконто];

			Если ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.Контрагенты") Тогда
				Контрагент = ЗначениеСубконто;

			ИначеЕсли ТипЗнч(ЗначениеСубконто) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Договор = ЗначениеСубконто;

			КонецЕсли;

		КонецЦикла;

		ТекДок = Выборка.Регистратор.Метаданные().Синоним + " № " + Выборка.Регистратор.Номер;

		// определяем основание поступления денежных средств
		Если ОбщегоНазначения.ЗначениеНеЗаполнено(Договор) Тогда

			ОснованиеРасхода = СокрЛП(Выборка.Содержание) + " на основании: " + ТекДок;

		Иначе

			ОснованиеРасхода = ПолноеНаименование(Контрагент);
			ОснованиеРасхода = ОснованиеРасхода + ", " + Договор;
			ОснованиеРасхода = ОснованиеРасхода + ", на основании: " + ТекДок;

		КонецЕсли;

		ОбластьСтрока.Параметры.ОснованиеРасхода = ОснованиеРасхода;

		// Условие и вид расхода денежных средств
		Если Выборка.Счет = Сч76_01 Тогда

			УсловиеРасхода = "";
			ВидРасхода     = "Имущественное и личное страхование";

		ИначеЕсли (Выборка.Счет = Сч60_02) или (Выборка.Счет = Сч60_22) или (Выборка.Счет = Сч60_32) Тогда

			УсловиеРасхода = "Аванс выданный";
			ВидРасхода     = "";

		ИначеЕсли (Выборка.Счет = Сч60_01) или (Выборка.Счет = Сч60_21) или (Выборка.Счет = Сч60_31) Тогда

			УсловиеРасхода = "Оплата ранее полученного имущества, работ, услуг прав";
			ВидРасхода     = "";

		ИначеЕсли (Выборка.Счет = Сч62_02) или (Выборка.Счет = Сч62_22) или (Выборка.Счет = Сч62_32) Тогда
			УсловиеРасхода = "Возврат ранее полученных авансов";
			ВидРасхода     = "";

		ИначеЕсли Выборка.Счет = Сч58_01 Тогда
			УсловиеРасхода = "Приобретение паев и акций";
			ВидРасхода     = "";

		ИначеЕсли Выборка.Счет = Сч58_02 Тогда
			УсловиеРасхода = "Приобретение ценных бумаг";
			ВидРасхода     = "";

		ИначеЕсли Выборка.Счет = Сч58_03 Тогда
			УсловиеРасхода = "На условиях возврата";
			ВидРасхода     = "";

		ИначеЕсли Выборка.Счет = Сч58_04 Тогда
			УсловиеРасхода = "Вклады в простое товарищество";
			ВидРасхода     = "";

		ИначеЕсли Выборка.Счет = Сч58_05 Тогда
			УсловиеРасхода = "Приобретение имущественных прав";
			ВидРасхода     = "";

		ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(Сч68) или Выборка.Счет.ПринадлежитЭлементу(Сч69) Тогда
			УсловиеРасхода = "Обязательные платежи в бюджет и внебюджетные фонды";
			ВидРасхода     = "";

		ИначеЕсли Выборка.Счет = Сч70 Тогда
			УсловиеРасхода = "Оплата труда";
			ВидРасхода     = "";

		ИначеЕсли Выборка.Счет = Сч91_02 Тогда

			// Необходим анализ вида расхода
			Если (Выборка.Субконто1.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.РасходыНаУслугиБанков) Тогда
				УсловиеРасхода = "";
				ВидРасхода     = "Услуги банков";

			ИначеЕсли (Выборка.Субконто1.ВидПрочихДоходовИРасходов = Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыНеУчитываемыеВЦеляхНалогообложения) Тогда
				УсловиеРасхода = "Прочие расходы, не принимаемые для налогообложения";
				ВидРасхода     = "";

			Иначе
				УсловиеРасхода = "Прочие расходы, не связанные с движением задолженности";
				ВидРасхода     = "";

			КонецЕсли;

		ИначеЕсли Выборка.Счет.ПринадлежитЭлементу(Сч50) или (Выборка.Счет = Сч51) или (Выборка.Счет = Сч52) или Выборка.Счет.ПринадлежитЭлементу(Сч55) Тогда
			УсловиеРасхода = "Внутреннее перемещение (из кассы в банк и т.п.)";
			ВидРасхода     = "";

		ИначеЕсли Не Контрагент.Пустая() Тогда
			УсловиеРасхода = "Прочие расходы, связанные с движением задолженности";
			ВидРасхода     = "";

		Иначе

			УсловиеРасхода = "Прочие расходы, не связанные с движением задолженности";
			ВидРасхода     = "";

		КонецЕсли;

		ОбластьСтрока.Параметры.УсловиеРасхода = УсловиеРасхода;
		ОбластьСтрока.Параметры.ВидРасхода = ВидРасхода;

		ДокументРезультат.Вывести(ОбластьСтрока);

	КонецЦикла;

	СтруктураЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаКон);
	ОбластьПодвал.Параметры.ОтветственныйЗаРегистры = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(СтруктураЛиц.ОтветственныйЗаРегистры);

	ОбластьПодвалТаблицы.Параметры.ИтогСумма = ИтогСумма;

	ДокументРезультат.Вывести(ОбластьПодвалТаблицы);
	ДокументРезультат.Вывести(ОбластьПодвал);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП   = Новый НастройкаПериода;

Сч50 = ПланыСчетов.Хозрасчетный.Касса;
Сч51 = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
Сч52 = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
Сч55 = ПланыСчетов.Хозрасчетный.СпециальныеСчета;

CписокСчетов = Новый СписокЗначений;
CписокСчетов.Добавить(Сч50);
CписокСчетов.Добавить(Сч51);
CписокСчетов.Добавить(Сч52);
CписокСчетов.Добавить(Сч55);

Сч60_01 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01");
Сч60_21 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.21");
Сч60_31 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.31");
Сч62_02 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02");
Сч62_22 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.22");
Сч62_32 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.32");
Сч58_03 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("58.03");
Сч60_02 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.02");
Сч60_22 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.22");
Сч60_32 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.32");

Сч76_01 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.01");
Сч58_01 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("58.01");
Сч58_02 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("58.02");
Сч58_04 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("58.04");
Сч58_05 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("58.05");
Сч68    = ПланыСчетов.Хозрасчетный.НайтиПоКоду("68");
Сч69    = ПланыСчетов.Хозрасчетный.НайтиПоКоду("69");
Сч70    = ПланыСчетов.Хозрасчетный.НайтиПоКоду("70");
Сч91_02 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.02");

#КонецЕсли
